MikroElektronika/core_packages/RX/gcc/def/renesas/R5F566TAEDFP/mcu.h
#define	MSTP_DMAC	SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DMAC0	SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DMAC1	SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DMAC2	SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DMAC3	SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DMAC4	SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DMAC5	SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DMAC6	SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DMAC7	SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DTC	SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_S12AD2	SYSTEM.MSTPCRA.BIT.MSTPA23
#define	MSTP_DA		SYSTEM.MSTPCRA.BIT.MSTPA19
#define	MSTP_S12AD	SYSTEM.MSTPCRA.BIT.MSTPA17
#define	MSTP_S12AD1	SYSTEM.MSTPCRA.BIT.MSTPA16
#define	MSTP_CMT0	SYSTEM.MSTPCRA.BIT.MSTPA15
#define	MSTP_CMT1	SYSTEM.MSTPCRA.BIT.MSTPA15
#define	MSTP_CMT2	SYSTEM.MSTPCRA.BIT.MSTPA14
#define	MSTP_CMT3	SYSTEM.MSTPCRA.BIT.MSTPA14
#define	MSTP_MTU	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU0	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU1	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU2	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU3	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU4	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU5	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU6	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU7	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU9	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_GPTW	SYSTEM.MSTPCRA.BIT.MSTPA7
#define	MSTP_GPTW0	SYSTEM.MSTPCRA.BIT.MSTPA7
#define	MSTP_GPTW1	SYSTEM.MSTPCRA.BIT.MSTPA7
#define	MSTP_GPTW2	SYSTEM.MSTPCRA.BIT.MSTPA7
#define	MSTP_GPTW3	SYSTEM.MSTPCRA.BIT.MSTPA7
#define	MSTP_GPTW4	SYSTEM.MSTPCRA.BIT.MSTPA7
#define	MSTP_GPTW5	SYSTEM.MSTPCRA.BIT.MSTPA7
#define	MSTP_GPTW6	SYSTEM.MSTPCRA.BIT.MSTPA7
#define	MSTP_GPTW7	SYSTEM.MSTPCRA.BIT.MSTPA7
#define	MSTP_GPTW8	SYSTEM.MSTPCRA.BIT.MSTPA7
#define	MSTP_GPTW9	SYSTEM.MSTPCRA.BIT.MSTPA7
#define	MSTP_HRPWM	SYSTEM.MSTPCRA.BIT.MSTPA7
#define	MSTP_POEG	SYSTEM.MSTPCRA.BIT.MSTPA7
#define	MSTP_TMR0	SYSTEM.MSTPCRA.BIT.MSTPA5
#define	MSTP_TMR1	SYSTEM.MSTPCRA.BIT.MSTPA5
#define	MSTP_TMR01	SYSTEM.MSTPCRA.BIT.MSTPA5
#define	MSTP_TMR2	SYSTEM.MSTPCRA.BIT.MSTPA4
#define	MSTP_TMR3	SYSTEM.MSTPCRA.BIT.MSTPA4
#define	MSTP_TMR23	SYSTEM.MSTPCRA.BIT.MSTPA4
#define	MSTP_TMR4	SYSTEM.MSTPCRA.BIT.MSTPA3
#define	MSTP_TMR5	SYSTEM.MSTPCRA.BIT.MSTPA3
#define	MSTP_TMR45	SYSTEM.MSTPCRA.BIT.MSTPA3
#define	MSTP_TMR6	SYSTEM.MSTPCRA.BIT.MSTPA2
#define	MSTP_TMR7	SYSTEM.MSTPCRA.BIT.MSTPA2
#define	MSTP_TMR67	SYSTEM.MSTPCRA.BIT.MSTPA2
#define	MSTP_SCI1	SYSTEM.MSTPCRB.BIT.MSTPB30
#define	MSTP_SMCI1	SYSTEM.MSTPCRB.BIT.MSTPB30
#define	MSTP_SCI5	SYSTEM.MSTPCRB.BIT.MSTPB26
#define	MSTP_SMCI5	SYSTEM.MSTPCRB.BIT.MSTPB26
#define	MSTP_SCI6	SYSTEM.MSTPCRB.BIT.MSTPB25
#define	MSTP_SMCI6	SYSTEM.MSTPCRB.BIT.MSTPB25
#define	MSTP_CRC	SYSTEM.MSTPCRB.BIT.MSTPB23
#define	MSTP_RIIC0	SYSTEM.MSTPCRB.BIT.MSTPB21
#define	MSTP_USB0	SYSTEM.MSTPCRB.BIT.MSTPB19
#define	MSTP_RSPI0	SYSTEM.MSTPCRB.BIT.MSTPB17
#define	MSTP_CMPC	SYSTEM.MSTPCRB.BIT.MSTPB10
#define	MSTP_CMPC0	SYSTEM.MSTPCRB.BIT.MSTPB10
#define	MSTP_CMPC1	SYSTEM.MSTPCRB.BIT.MSTPB10
#define	MSTP_CMPC2	SYSTEM.MSTPCRB.BIT.MSTPB10
#define	MSTP_CMPC3	SYSTEM.MSTPCRB.BIT.MSTPB10
#define	MSTP_CMPC4	SYSTEM.MSTPCRB.BIT.MSTPB10
#define	MSTP_CMPC5	SYSTEM.MSTPCRB.BIT.MSTPB10
#define	MSTP_ELC	SYSTEM.MSTPCRB.BIT.MSTPB9
#define	MSTP_DOC	SYSTEM.MSTPCRB.BIT.MSTPB6
#define	MSTP_SCI12	SYSTEM.MSTPCRB.BIT.MSTPB4
#define	MSTP_SMCI12	SYSTEM.MSTPCRB.BIT.MSTPB4
#define	MSTP_CAN0	SYSTEM.MSTPCRB.BIT.MSTPB0
#define	MSTP_SCI8	SYSTEM.MSTPCRC.BIT.MSTPC27
#define	MSTP_SMCI8	SYSTEM.MSTPCRC.BIT.MSTPC27
#define	MSTP_SCI9	SYSTEM.MSTPCRC.BIT.MSTPC26
#define	MSTP_SMCI9	SYSTEM.MSTPCRC.BIT.MSTPC26
#define	MSTP_SCI11	SYSTEM.MSTPCRC.BIT.MSTPC24
#define	MSTP_SMCI11	SYSTEM.MSTPCRC.BIT.MSTPC24
#define	MSTP_CAC	SYSTEM.MSTPCRC.BIT.MSTPC19
#define	MSTP_ECCRAM	SYSTEM.MSTPCRC.BIT.MSTPC6
#define	MSTP_RAM	SYSTEM.MSTPCRC.BIT.MSTPC0
#define	MSTP_TSIP	SYSTEM.MSTPCRD.BIT.MSTPD27

#define	IS_CAN0_ERS0	IS0
#define	IS_SCI1_TEI1	IS2
#define	IS_SCI1_ERI1	IS3
#define	IS_SCI5_TEI5	IS10
#define	IS_SCI5_ERI5	IS11
#define	IS_SCI6_TEI6	IS12
#define	IS_SCI6_ERI6	IS13
#define	IS_SCI12_TEI12	IS16
#define	IS_SCI12_ERI12	IS17
#define	IS_SCI12_SCIX0	IS18
#define	IS_SCI12_SCIX1	IS19
#define	IS_SCI12_SCIX2	IS20
#define	IS_SCI12_SCIX3	IS21
#define	IS_CAC_FERRI	IS26
#define	IS_CAC_MENDI	IS27
#define	IS_CAC_OVFI		IS28
#define	IS_DOC_DOPCI	IS29
#define	IS_POEG_POEGGAI	IS0
#define	IS_POEG_POEGGBI	IS1
#define	IS_POEG_POEGGCI	IS2
#define	IS_POEG_POEGGDI	IS3
#define	IS_POE3_OEI5		IS8
#define	IS_POE3_OEI1		IS9
#define	IS_POE3_OEI2		IS10
#define	IS_POE3_OEI3		IS11
#define	IS_POE3_OEI4		IS12
#define	IS_RIIC0_TEI0	IS13
#define	IS_RIIC0_EEI0	IS14
#define	IS_S12AD2_S12CMPAI2	IS18
#define	IS_S12AD2_S12CMPBI2	IS19
#define	IS_S12AD_S12CMPAI	IS20
#define	IS_S12AD_S12CMPBI	IS21
#define	IS_S12AD1_S12CMPAI1	IS22
#define	IS_S12AD1_S12CMPBI1	IS23
#define	IS_SCI8_TEI8	IS24
#define	IS_SCI8_ERI8	IS25
#define	IS_SCI9_TEI9	IS26
#define	IS_SCI9_ERI9	IS27
#define	IS_SCI11_TEI11	IS12
#define	IS_SCI11_ERI11	IS13
#define	IS_RSPI0_SPII0	IS16
#define	IS_RSPI0_SPEI0	IS17

#define	EN_CAN0_ERS0	EN0
#define	EN_SCI1_TEI1	EN2
#define	EN_SCI1_ERI1	EN3
#define	EN_SCI5_TEI5	EN10
#define	EN_SCI5_ERI5	EN11
#define	EN_SCI6_TEI6	EN12
#define	EN_SCI6_ERI6	EN13
#define	EN_SCI12_TEI12	EN16
#define	EN_SCI12_ERI12	EN17
#define	EN_SCI12_SCIX0	EN18
#define	EN_SCI12_SCIX1	EN19
#define	EN_SCI12_SCIX2	EN20
#define	EN_SCI12_SCIX3	EN21
#define	EN_CAC_FERRI	EN26
#define	EN_CAC_MENDI	EN27
#define	EN_CAC_OVFI		EN28
#define	EN_DOC_DOPCI	EN29
#define	EN_POEG_POEGGAI	EN0
#define	EN_POEG_POEGGBI	EN1
#define	EN_POEG_POEGGCI	EN2
#define	EN_POEG_POEGGDI	EN3
#define	EN_POE3_OEI5		EN8
#define	EN_POE3_OEI1		EN9
#define	EN_POE3_OEI2		EN10
#define	EN_POE3_OEI3		EN11
#define	EN_POE3_OEI4		EN12
#define	EN_RIIC0_TEI0	EN13
#define	EN_RIIC0_EEI0	EN14
#define	EN_S12AD2_S12CMPAI2	EN18
#define	EN_S12AD2_S12CMPBI2	EN19
#define	EN_S12AD_S12CMPAI	EN20
#define	EN_S12AD_S12CMPBI	EN21
#define	EN_S12AD1_S12CMPAI1	EN22
#define	EN_S12AD1_S12CMPBI1	EN23
#define	EN_SCI8_TEI8	EN24
#define	EN_SCI8_ERI8	EN25
#define	EN_SCI9_TEI9	EN26
#define	EN_SCI9_ERI9	EN27
#define	EN_SCI11_TEI11	EN12
#define	EN_SCI11_ERI11	EN13
#define	EN_RSPI0_SPII0	EN16
#define	EN_RSPI0_SPEI0	EN17

#define	CLR_CAN0_ERS0	CLR0

#define	GEN_CAN0_ERS0	GENBE0
#define	GEN_SCI1_TEI1	GENBL0
#define	GEN_SCI1_ERI1	GENBL0
#define	GEN_SCI5_TEI5	GENBL0
#define	GEN_SCI5_ERI5	GENBL0
#define	GEN_SCI6_TEI6	GENBL0
#define	GEN_SCI6_ERI6	GENBL0
#define	GEN_SCI12_TEI12	GENBL0
#define	GEN_SCI12_ERI12	GENBL0
#define	GEN_SCI12_SCIX0	GENBL0
#define	GEN_SCI12_SCIX1	GENBL0
#define	GEN_SCI12_SCIX2	GENBL0
#define	GEN_SCI12_SCIX3	GENBL0
#define	GEN_CAC_FERRI	GENBL0
#define	GEN_CAC_MENDI	GENBL0
#define	GEN_CAC_OVFI		GENBL0
#define	GEN_DOC_DOPCI	GENBL0
#define	GEN_POEG_POEGGAI	GENBL1
#define	GEN_POEG_POEGGBI	GENBL1
#define	GEN_POEG_POEGGCI	GENBL1
#define	GEN_POEG_POEGGDI	GENBL1
#define	GEN_POE3_OEI5			GENBL1
#define	GEN_POE3_OEI1			GENBL1
#define	GEN_POE3_OEI2			GENBL1
#define	GEN_POE3_OEI3			GENBL1
#define	GEN_POE3_OEI4			GENBL1
#define	GEN_RIIC0_TEI0	GENBL1
#define	GEN_RIIC0_EEI0	GENBL1
#define	GEN_S12AD2_S12CMPAI2	GENBL1
#define	GEN_S12AD2_S12CMPBI2	GENBL1
#define	GEN_S12AD_S12CMPAI	GENBL1
#define	GEN_S12AD_S12CMPBI	GENBL1
#define	GEN_S12AD1_S12CMPAI1	GENBL1
#define	GEN_S12AD1_S12CMPBI1	GENBL1
#define	GEN_SCI8_TEI8	GENBL1
#define	GEN_SCI8_ERI8	GENBL1
#define	GEN_SCI9_TEI9	GENBL1
#define	GEN_SCI9_ERI9	GENBL1
#define	GEN_SCI11_TEI11	GENAL0
#define	GEN_SCI11_ERI11	GENAL0
#define	GEN_RSPI0_SPII0	GENAL0
#define	GEN_RSPI0_SPEI0	GENAL0

